CSI API ETABS v1
cLoadPatterns Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cLoadPatterns
Public Interface cLoadPatterns
Dim instance As cLoadPatterns
public interface class cLoadPatterns
type cLoadPatterns =  interface end
The cLoadPatterns type exposes the following members.
Properties
Name | Description
AutoSeismic
AutoWind
Top
Methods
Name | Description
Add
 Adds a new load pattern.
ChangeName
 Applies a new name to a load pattern.
Count
 Retrieves the number of defined load patterns.
Delete
 Deletes the specified load pattern.
GetAutoSeismicCode
 Retrieves the code name used for auto seismic parameters in Quake-type load patterns.
GetAutoWindCode
 Retrieves the code name used for auto wind parameters in Wind-type load patterns.
GetLoadType
 Retrieves the load type for a specified load pattern.
GetNameList
 Retrieves the names of all defined load cases.
GetSelfWTMultiplier
 Retrieves the self weight multiplier for a specified load pattern.
SetLoadType
 Assigns a load type to a load pattern.
SetSelfWTMultiplier
 Assigns a self weight multiplier to a load case.
Top
See Also
Reference
ETABSv1 Namespace